{
  "chunks": [
    "If you can only have one computer to do all of your stuff every single task that you need, you would probably be this one, the ASUS G14. Before we look at the laptop, let's have a little look at the charger. For power, we've got 180 watt power adapter that is delivered through the ASUS Slim Power Jack TN. This right here is kind of like USB Type-C, but you can't plug USB Type-C stuff into it. That would be a bad time. And it also delivers way more current, which allows us to actually have higher efficiency so here is the brand new 2024 ASUS G14. Now you will see that we are missing the animatrix on the back, which is a little bit sad because I really like putting a line of sad face just on the back of my laptop, but at the same time, how much I'm actually gonna miss it is almost zero. The IO that we get is really quite good given the size of this thing. So on the right hand side, we have an SD card reader, just the small one, full size USB Type-A and a Type-C that does 10",
    "IO that we get is really quite good given the size of this thing. So on the right hand side, we have an SD card reader, just the small one, full size USB Type-A and a Type-C that does 10 gigabit and display port. On the left hand side, we have headphone-mic from combo jack, another USB Type-A, a Type-C, full size HDMI 2.1, and our little ASUS Slim Power Jack TN. It seems pretty light. Pretty light for a 4070 at least. What do you think? This seems rigged around 3.7 pounds maybe? Oh no, 3.3. It is actually lighter than I expected, which is, what good? Oh, oh, oh, oh, oh. We have the full aluminum body for this year. All CNC machine, I have to say, it looks absolutely fantastic. This right here is like MacBook levels of quality. This might be close to exceeding a MacBook quality. Let's see, 14 inch MacBooks, 14 inch ASUS. Oh, that's pretty darn close. The ASUS might even have the edge, which is shocking. Before I turn this on, I've heard that these will speak to you a little bit when they stir it up. Let's see. Wow, that sounded",
    "that's pretty darn close. The ASUS might even have the edge, which is shocking. Before I turn this on, I've heard that these will speak to you a little bit when they stir it up. Let's see. Wow, that sounded just like a segue to this sponsor. Thanks to ZenMarket for sponsoring this video. Buying from overseas can be troublesome and expensive, but ZenMarket helps by consolidating orders for free and sending them out as few shipments as possible. So if you're missing something from the collection you just bought, you can add it for no additional cost. In fact, ZenMarket has a 60-day free storage period, which means you can keep shopping for more stuff before confirming your full order. Over 10,000 Japanese stores are supported like Amazon, Rakuten, or if you're looking for some more niche products like these albums from Tower Records or this 3DS LL from Surugaya, ZenMarket can help you too. Simply copy the item link and paste it into the search bar, fill in some info and let the buying team do the rest. ZenMarket has support for 90 languages and is trusted by over 2 million users worldwide, so don't wait. Even better,",
    "link and paste it into the search bar, fill in some info and let the buying team do the rest. ZenMarket has support for 90 languages and is trusted by over 2 million users worldwide, so don't wait. Even better, ZenMarket is celebrating their 10th anniversary, so from now up until April 30th, you can get 1,000 bonus Zen points, the equivalent of 1,000 yen off your international shipping fee and get 10% off your first parcel. Just visit the link below, create a free account and use the code short-circuit and Zen10 ship. All right, let's have a gander at how powerful this thing is. So for the processor, we have an AMD Ryzen 9 8945HS, which has AI in it. It's apparently the same as 7,000, but with some AI bolted on and really, that's probably going to be really good for you in the future. I feel like these sort of AI accelerators will not be super useful for a couple of years, but will be the sort of thing where in five or 10 years, it might be the difference between this laptop running kind of well and just being awful. Remember, we have 32 gigabytes",
    "useful for a couple of years, but will be the sort of thing where in five or 10 years, it might be the difference between this laptop running kind of well and just being awful. Remember, we have 32 gigabytes of DDR5, 6400 mega transfer per second stuff. And here, a WD1 terabyte SSD, a media tech Wi-Fi 6E chip, Jenna get a boo. Boop. Thank you. I really do not like media tech. I've had so many issues where I'm using an AMD laptop that has a media tech Wi-Fi card in it. And whenever I go between access points, it's really bad for dropping out or just generally not being reliable. I much prefer the Intel ones. And if you can swap one of those into here, I would highly, highly recommend it. But we also have that's very controversial. Is the Nvidia RTX 4070. That's controversial because last year's model had up to a 4090. And now a 4070 is as high as you can go in this. And I personally think that's totally fine. I have seen some people complaining online, but this is so much thinner and just generally more portable than last year's version",
    "a 4070 is as high as you can go in this. And I personally think that's totally fine. I have seen some people complaining online, but this is so much thinner and just generally more portable than last year's version that I think the trade-off is quite good. Especially since you're not getting the performance of a 4090 in this, this cannot properly cool a 4090. Like you can physically put it in here, but why? It's just going to be loud. It's not going to be all of the 4090's performance. And I really like what Asus has done here and just made the laptop smaller and put the GPU that people actually buy in. Or get mad at me down below. Maybe you want the 4090. By last year's. And finally, there's an AMD Radeon 780M. That is just the integrated graphics. And it allows us to do, you know, normal integrated graphics stuff. And guessing no touch screen? Yeah, no touch screen, but oh, this is an incredible panel, especially for a laptop of this size. So it is OLED, love to see that, 2880 by 1800. So that's sort of like you're 1440p, but stretchulated vertically.",
    "screen? Yeah, no touch screen, but oh, this is an incredible panel, especially for a laptop of this size. So it is OLED, love to see that, 2880 by 1800. So that's sort of like you're 1440p, but stretchulated vertically. So you have that 16 by 10, which is just awesome because you can see so much extra content when you're doing like web browsing, working on videos, photos, words, any of those. Now for the display, you're going to want to configure settings because it does really change how well this panel is delivering the photons to your eyeballs. So in the Army Creek here, we go over to Game Visual. Now the color gamut, native, right here, is a vivid profile. And that is going to just see your eyeballs with the most vivid of vivid colors. Now a lot of people do like that, but if you want to do photo editing or just generally look at things, how they were intended, it has an average delta E of 4.4, which is just not very good. The good news is though, if we come in here, go from native to just SRGB and apply that. We now",
    "things, how they were intended, it has an average delta E of 4.4, which is just not very good. The good news is though, if we come in here, go from native to just SRGB and apply that. We now have a display that isn't quite as vibrant, but it is able to deliver those visuals to you with an average delta E of 0.9, which is absolutely fantastic. We'll expect below two for professional color work. So this right here, you can be doing professional color work and I don't know, uploading your bestest pictures to Instagram that you've ever done. Now one thing that is unfortunate is that for whatever reason, this laptop got really mad at the software that we use to check the color accuracy of displays when it was in HDR. So we were able to verify that it has a brightness of 600 Nits in HDR, which is very impressive. But we weren't able to verify if it is color accurate in HDR. That said though, it looks really good in HDR. We could tell you that much. And given its SDR performance, we do imagine it is very, very good. We just cannot",
    "to verify if it is color accurate in HDR. That said though, it looks really good in HDR. We could tell you that much. And given its SDR performance, we do imagine it is very, very good. We just cannot verify that with anything other than our eyeballs. Us thing to talk about hardware wise is the keyboard and the trackpad. And they are excellent. I would give it a very solid A. Like if we look great here, keycap stability is excellent. I can push on the corner and get a tiny bit of deflection, but if I really press on it, the whole key is going to actuate long before the corner of this key gets below the chassis. Also the consistency from key to key, fantastic. Also below the keyboard, we have this trackpad and it is excellent. It's nice and large, really as big as they could get in here. That was a very large sourcepot on the previous G14s. You were kind of giving up a good trackpad for having like a 49er or whatever the heck. Now of course, this is a gaming laptop. So I want to make sure that you guys get",
    "on the previous G14s. You were kind of giving up a good trackpad for having like a 49er or whatever the heck. Now of course, this is a gaming laptop. So I want to make sure that you guys get a really good idea of how this works in the games that you are definitely going to play, starting and probably ending with crab champions. So guys, we've discovered one problem here. 2880 by 1800 is pretty strange. Normally if you have more of like a 1440p, you would go for 2560 by 1600. So this is a little bit larger and this game does not support it. Lots of games probably don't support it really. If they just have a setting menu, so that might be annoying at times. That still looks pretty darn good though. First thing that I'm noticing, this OLED display looks fantastic. So it seemed to be getting a pretty solid 110 to 130 FPS. Okay, the smoothness of this display is incredible. And that's aided a lot by the fact that this has g-sync. Now in our LTT video, we go into this in more depth, but basically this panel is refreshing or more",
    "Okay, the smoothness of this display is incredible. And that's aided a lot by the fact that this has g-sync. Now in our LTT video, we go into this in more depth, but basically this panel is refreshing or more so updating, 960 times every single second. That allows you to get around the problems of changing how long each pixel is on for. It's always on 960 times per second and how many times you display each frame. It's how you get that g-sync variable refresh rate instead of trying to like make each individual frame last a different amount of time. Besides crab game, we try this out in a couple different games. I guess Lenovo Legion Slim 7i. Both has an i9, a 4070, and 32 gigabytes of RAM. So it's pretty comparable to this, although it is larger, so you would expect it to be a little bit better and it was. I would say something like 10% faster or so, which is very impressive for the G14, given that it is significantly smaller and nearly as powerful. So good job there, Asus. Okay, how are the speakers in this? That sounds very clear. Oh, what",
    "like 10% faster or so, which is very impressive for the G14, given that it is significantly smaller and nearly as powerful. So good job there, Asus. Okay, how are the speakers in this? That sounds very clear. Oh, what Asus was here, they said this might be the best sounding 14 inch laptop and they might be right. All right, compared to the HP. Wow. It's way better than the HP Dragonfly. MacBook, very few laptops, get to the MacBook stage of this test. All right, here's the Asus Epirus G14. Oh, that's really close. MacBook Pro 14. Oh. I think we can call that a tie. The MacBook has a little bit more on the high end, but I think that's more so just the target curve that they're going for. You could probably get a little bit more trouble on this if you wanted to, but they're both loud. They're both clear, excellent job Asus on this. And finally, let's have a look at the webcam. This thing is 1080p. You guys remember when they used to not even have webcam on this thing? That was stupid. I'm glad they changed that. And this one's really, really",
    "And finally, let's have a look at the webcam. This thing is 1080p. You guys remember when they used to not even have webcam on this thing? That was stupid. I'm glad they changed that. And this one's really, really good. Look at that. Up here, we also have Windows Hello facial recognition so you can get into it just using your face. Even that is getting a little bit confused, but like fair enough, there's big bright lights right here and you can even see Andy. 11 T6 screws later, some of which are different lengths so be careful, we can get inside. First thing in here, we have a 73 watt hour battery and in our testing, it was able to get us a very impressive nearly 10 hours, which for a gaming laptop particularly one with a 4070 is incredibly impressive. That's how you're able to have a laptop like this where I was saying, if you can only have one computer by this one, that's what this has that stands out against the competition. Like that Slim 7 that we're talking about before. That Slim 7 got four hours and 45 minutes. Now, if you do",
    "can only have one computer by this one, that's what this has that stands out against the competition. Like that Slim 7 that we're talking about before. That Slim 7 got four hours and 45 minutes. Now, if you do want to fully load this thing up with combustor for some reason on battery, it does only get you an hour, but at the same time, just don't do that, please. Here we can see our Wi-Fi card is replaceable, which is excellent because you'll want to do that. And we have our SSD over here. One thing that's very, very sad though is that you cannot upgrade the RAM. It is all soldered down. On the old version, you had one sodium slot that you were able to swap in and out, this one nothing. Couple more fun things to look at in here. We have three fans, they've got the little one in the middle which is apparently great for your VRMs and just keeping your temperatures down on the keyboard. Actually, one thing that I didn't talk about before but is very nice is that these do have a little bit of ventilation right through WASD so",
    "great for your VRMs and just keeping your temperatures down on the keyboard. Actually, one thing that I didn't talk about before but is very nice is that these do have a little bit of ventilation right through WASD so your hands don't get too hot while you're gaming. Now, this cooler compared to some of the others that we have seen is not the most impressive, but they are able to overcome some of that by just simply using liquid metal on this. And of course, finally the price. This model that we have right here with 32 gigabytes of RAM, terabyte of storage and the 4070 will cost you $2,000 US. Now, if you do want to spend a little bit less, you can get a 4060, 16 gigabytes of RAM and a one terabyte SSD for $1,600 US dollars, which is pretty good. And it's also pretty darn close to the Omen Transcend 14 which we're going to be looking at very, very soon. It's on my desk right now. Hey like, get subscribed, see you later.",
    "to be looking at very, very soon. It's on my desk right now. Hey like, get subscribed, see you later."
  ]
}