{
  "chunks": [
    "What is TensorFlow? What is TensorFlow? TensorFlow is one of the most in-demand tools used by ML or AI engineers. It is an open source framework developed by Google that is used to build various machine learning and deep learning models. TensorFlow helps to train and execute neural network image recognition, natural language processing, digit classification and much more. By using the same models that are used for development, TensorFlow facilitates the estimation of output at various scales. The main objective of using TensorFlow is not just the development of a deep neural network, but TensorFlow is focused to reduce the complexity of implementing computations on large numerical datasets. Since deep learning models require a lot of computation for attaining accuracy, companies started using TensorFlow. Now, sequently, Google made TensorFlow available to all. How does TensorFlow work? One of the best things about TensorFlow is that it provides a feature that helps to create structures for machine learning models. These structures are made of data flow graphs. Data flow graphs denote the functionalities that you want to implement. It consists of a set of nodes in a well-defined order where you can specify the methods for computation. In the TensorFlow",
    "structures are made of data flow graphs. Data flow graphs denote the functionalities that you want to implement. It consists of a set of nodes in a well-defined order where you can specify the methods for computation. In the TensorFlow graph, data flow graphs also shows us how data, including its functioning, moves through the graph. However, the data that you need to feed into the model should be a multi-dimensional array while using TensorFlow for your applications. These multi-dimensional arrays are known as tensors and they are very helpful while dealing with large amounts of data. In a graph, every node represents a mathematical operation, while each connection or edge between nodes is a multi-dimensional data array. Tens of flow architecture for building models. Data preprocessing. Here, you have to prepare data for the purpose of feeding it to the model that you need to build. It includes removing duplicate values, feature scaling, standardization and many other tasks. Model building. The next step after data preprocessing is model building, where you create your model by using various algorithms, model training and evaluation. The final step after building your model is training and evaluating it to check whether it generates",
    "building. The next step after data preprocessing is model building, where you create your model by using various algorithms, model training and evaluation. The final step after building your model is training and evaluating it to check whether it generates accurate output or not. So that's all for this session on what is tens of flow. Stay tuned for much more informational video."
  ]
}