{
  "chunks": [
    "RTX 5000 series laptops are here, and ASUS sponsored this video to check it out. This right here is the ROG Strix Scar 16. We also have the 18, and I cannot wait to show you just how fast these things are. Oh, guys, look at this. The box is so fancy. I'm coming here, and when you lift it up, oh wow, it's on a little pedestal. Before we look at the laptop, let's see how much can draw from the wall. 380 watts is quite a bit, and that is delivered over ASUS's proprietary connector here. Now, I would really like to see USB-C, but you cannot deliver 380 watts over that, and they do have 100 watt charging over USB-C if you want to do that over some other brick. I asked we have the standard stuff here, plug it in, open it up, turn it on, you're good. Now here today we have the 16 inch, and also the 18 inch, but at the same time, we don't really have the 18 inch, because they gave it to us, but we're not allowed to do any testing or anything like that, because this is a pre-production",
    "and also the 18 inch, but at the same time, we don't really have the 18 inch, because they gave it to us, but we're not allowed to do any testing or anything like that, because this is a pre-production sample. Looking at the two laptops, it seems like at the main difference is that the 18 inch is bigger. Wow, and also it has a numpad on the right-hand side here. So if you are planning on doing this for work and play, maybe you're an engineer or something like that, and you want an actual numpad, 18 inches for you. Otherwise, I would probably stick with the 16. One thing I do have to say though, the 18 inch screen is fricking massive. Like it makes sense, of course, it's a really big screen for a laptop, but man, this is a desktop replacement. It is not a laptop, but anyway, I was not able to do anything with the 18 inch size look at it, so we have now done that. For 2025, the Strix lineup has been completely redesigned, and I do have to say this is a fine looking laptop. It looks quite professional. It",
    "with the 18 inch size look at it, so we have now done that. For 2025, the Strix lineup has been completely redesigned, and I do have to say this is a fine looking laptop. It looks quite professional. It is just dark, black rate here. Although, if you look right here, there's 9152 precision milled holes behind which there are 810 LEDs for the Anna Vision. Anna Mavision. Anna Mavision, yes, of course. Basically, you can put silly little designs here. We'll play around with the different stuff you can do with it later, but I do really like that you can either have it look crazy in-game or just turn it off and it looks kind of cool. There's just a couple holes. Oh, okay, I do like this. On the right side, we have two USB type A's, which excellent, but they have put almost all of the IO on the left-hand side where we have two Thunderbolt 5's USB type A, HDMI 2.1, 2.5 gig ethernet and our power plug. Oh, and also a little headphone microphone combo port right there, but there is also on the back is no IO, but a whole heck load",
    "Thunderbolt 5's USB type A, HDMI 2.1, 2.5 gig ethernet and our power plug. Oh, and also a little headphone microphone combo port right there, but there is also on the back is no IO, but a whole heck load of ventilation because I believe that they have a vapor chain breath that goes all the way across here for many a cooling. Now, Anna Mavision, I'm a bit curious if this aluminum back panel will reject fingerprints and oh, it's actually not bad. I was a little bit concerned that this coating would not reject fingerprints too good, but looking here, like, of course, can fingerprint it if I really want to, but, uh, hmm, that's pretty fingerprinted. It's not the worst I've ever seen, but it's not the best either. It's not like they're Sarah aluminum coating. Man, that is a heavy power brick. Actually, we didn't even look at how heavy this whole laptop is. Ooh, I always think it feels like it might crack five pounds. 6.1 ohch and then add in the power brick and you're gonna be carrying around 7.7, this is a 1.6 pound power adapter. Also, that's 3.5 kilograms and 2.7 kilograms",
    "always think it feels like it might crack five pounds. 6.1 ohch and then add in the power brick and you're gonna be carrying around 7.7, this is a 1.6 pound power adapter. Also, that's 3.5 kilograms and 2.7 kilograms for the rest of the world. All right, after getting into FISTA cups with the Windows utility for RGB and completely disabling that, I now have the most incredible light show that might have ever existed around the laptop. They have an RGB strip that goes literally all the way around the bottom, giving you this really quite neat little underglow for your laptop. Is this necessary in any way? No. Is it very cool? Yes. All right, let's have a look at this display right here. It is their new Nebula HDR display and it is 2560 by 1600, 240 hertz and they claim 1200 Nits peak brightness but it turns out that they really undersold it. We tested it and we saw a peak value of 2000 Nits and also in HDR, it was able to sustain over 1400 Nits pure white on the whole display which is really frickin bright. They're able to accomplish that kind of",
    "it and we saw a peak value of 2000 Nits and also in HDR, it was able to sustain over 1400 Nits pure white on the whole display which is really frickin bright. They're able to accomplish that kind of brightness by having a mini LED display. It's the sort of thing that you can't really do on OLEDs yet and also it has a dual ACR coating which is sort of like a matte finish which is incredible at rejecting bright spots. Like here you can see I have a standard screen with a typical coating and wow. That's a studio light right there. You sure as heck cannot see a single thing on my phone screen but if we move over to the ACR, double ACR coating, wow. That's really good. This legitimately is probably the best display if you want to do gaming in a bright room. It is fantastic. Okay, Bel just said who's outside gaming in the park but I have legitimately been thinking that I would really love to be able to game on my patio. So this would be pretty sick. One final thing about the display though we did measure the color",
    "in the park but I have legitimately been thinking that I would really love to be able to game on my patio. So this would be pretty sick. One final thing about the display though we did measure the color space and it got 99% of DCI B3 which is great. But of course a good display means nothing if you don't have the performance to back it up but we really do here. We have Intel Core Ultra 9275 HX which has 24 cores because up to 5.4 gigahertz and it is quite a quick one to help that. We have 32 gigabytes at 5600 mega transfers per second which is quite a bit slower than most of the RAM that's on the market these days but that's because it's replaceable. Love to see that. Also in here we have a two terabyte NVMe SSD that one's PCIe 4 but we have a PCIe 5 slot in here if you feel like going extra fast on your storage later. For Wi-Fi we have Intel Wi-Fi 7, love to see that and NPU for Intel very cool but the star of the show of course is the RTX 5080. This",
    "you feel like going extra fast on your storage later. For Wi-Fi we have Intel Wi-Fi 7, love to see that and NPU for Intel very cool but the star of the show of course is the RTX 5080. This entire system is able to draw up to 255 watts and the GPU alone is able to suck back 175 and we did confirm that with firmware. We were able to get to sustain 173 which is a lot of watts for a mobile GPU. If you do want even more power though you can't expect this with a 5090 but do know that the 5080 and a 5090 are not super dissimilar on mobile and you will not be getting extra power or wattage delivered to it. So don't expect it to be ground breakingly faster. I do really want to have a game on this but first let's have a look at the keyboard and trackpad. Trackpad right here is 36% bigger than last year and also it can be a numpad if you so cheap. So you can hold right here. Oh look at that, okay. I can take off the sticker now. I guess this is",
    "here is 36% bigger than last year and also it can be a numpad if you so cheap. So you can hold right here. Oh look at that, okay. I can take off the sticker now. I guess this is the thing that you can do. I don't really see how much I would use it but it's there. I'm not gonna complain about it especially when the trackpad itself is great. It is huge, it is glass topped and the click feel and overall tracking is fantastic. Fortunately we haven't really had to worry about crappy trackpads for a while on Windows ever since precision drivers came out and it's nice to see it just continue to be great. Same with the keyboard. Unsurprisingly the keyboard is fantastic. Asus has been doing a great job on their gaming laptops for years at this point and it's so nice that you don't have to get a gaming laptop and deal with a crap tier keyboard like you did a couple of years ago. This thing's fantastic. It's a little bit on sort of the softer side. That's not a bad thing especially for gaming where you might be holding W",
    "with a crap tier keyboard like you did a couple of years ago. This thing's fantastic. It's a little bit on sort of the softer side. That's not a bad thing especially for gaming where you might be holding W for a really long time. If you don't want to just be holding W though, up here at the top we have programmable macro keys if you don't want to be able to adjust your volume or turn off your mic. I just remembered we haven't been looking at the anime vision. Has been doing anything? Ah, sick. All right, we have the anime vision enabled now. So we have a bunch of pre-done animations like this one right here. You have your ROG stuff. Oh, what about raining? That one's kinda cool. Do you guys know what this is? Is it obvious? What do you think? Is that what we stay with for the rest of the shoot? Hell yeah. All right, what game do you guys want to play? Cyber Gun. That's good because I was kind of the only option. All right, how does this run some video games? I'm in Cyberpunk here, Ultra Settings, and I",
    "yeah. All right, what game do you guys want to play? Cyber Gun. That's good because I was kind of the only option. All right, how does this run some video games? I'm in Cyberpunk here, Ultra Settings, and I turned on DLSS and it is on Balance Mode. And I'm currently getting 60 FPS would appear. Oh, it's dropping a bit. It was way higher before. All right, we're getting about 55 FPS, which isn't too bad. It's decent enough, but I do have the system right now in silent mode. So let's try and increase that a bit. We're gonna sit here. We're at like 70 FPS or so, but we can go to Performance Mode. Ooh, 100 FPS. That's looking a bit better. I am also screen recording at the moment, but holy freak, I am much less concerned about the game itself. And this display is great. I know that I already talked about it, but that is frickin' bright. I'm sorry, Andrew, is the top down able to handle that at all? It's just frickin' blown out. So IRL, this looks pretty decent. It is very white, but it also looks like the sun is",
    "that is frickin' bright. I'm sorry, Andrew, is the top down able to handle that at all? It's just frickin' blown out. So IRL, this looks pretty decent. It is very white, but it also looks like the sun is glinting off of stuff. The top down, it is just getting destroyed. This display is way too bright for our camera. Are you able to like, ND filter this or something? There we go. I'm sorry, Edadair. Okay, so you now can see the details in the window here. Only problem is everything else is way too dark, but that really does show you the kind of dynamic range that you can get out of this display. It looks awesome in real life. The fans are definitely a little bit on the louder side. Now that we have put it into Performance Mode, I guess we can put her in full-blowns these turbo mode here and see how loud that is. Performance, I think, the vast majority of headphones, once you put them on, you will not be able to notice it or care. In Turbo Mode, it's increasing a bit and you might be a little bit cross. Also,",
    "is. Performance, I think, the vast majority of headphones, once you put them on, you will not be able to notice it or care. In Turbo Mode, it's increasing a bit and you might be a little bit cross. Also, do remember that everything that we're doing here is with screen recording. Looking at our labs results at 1600P, we were able to get 92 FPS on average in Cyberpunk and Medium settings, 179 FPS and F124 and 66 in total war hammer. And looking at our CPU results, we were able to get 151 watts out of the CPU in Cinebench, although it did hit 87 degrees, it is still very impressed that they're able to cool that much out of this little laptop. They do say that you'll be able to get up to 175 watts PL2 on the CPU and when combined with the IPC increases, it should be really quick, although we were not able to replicate that, you probably have to be in a really cold room to get that kind of performance. Now that we know that it can get a little bit loud from the fans in gaming, let's see how loud the",
    "replicate that, you probably have to be in a really cold room to get that kind of performance. Now that we know that it can get a little bit loud from the fans in gaming, let's see how loud the speakers can get. All right, it sounds loud and clear, but I feel like there's not gonna be a whole lot of bass here. It's not bad, it's definitely not a whole lot of bass in it, but it is clear and it is loud. Also here, it sounds quite wide. One second, curious if there's settings I can look at. Well, it turns out that you can't fill around with the surround sound settings, but it does sound pretty good. All right, let's check out this webcam. The first thing that I absolutely love about it is that they have Windows Hello Facial Recognition, so there's some little IR cameras that can pick up your face. It is the best way to get into your laptop in my opinion. Also, they have a new 1080p webcam, which I think looks decent. It's a little bit chunky for sure. Like there's some weird, there's some weird going on. I don't",
    "best way to get into your laptop in my opinion. Also, they have a new 1080p webcam, which I think looks decent. It's a little bit chunky for sure. Like there's some weird, there's some weird going on. I don't really know what to call it, but it is exposing pretty decently for my face. Right here, it's kinda hot on one side, but that's okay enough moving over here. It's doing a pretty decent job. There's a lot of noise though. I don't know what's up, there's like noise and some trails, which is interesting. That said though, that is not really going to affect your video calls, and it is exposing well, so I'll give it a pass. All right, let's have a look at the repairability here. First of all, the bottom of this looks pretty sick, ROG Strix, and it has a totally toolless design, so it is pushed to the left right there. Pull like that. That was incredibly simple. That is maybe the easiest laptop to get, and I have ever experienced. And here you can actually do some stuff. You can upgrade the RAM, I already talked about that, but Frig, so few",
    "that. That was incredibly simple. That is maybe the easiest laptop to get, and I have ever experienced. And here you can actually do some stuff. You can upgrade the RAM, I already talked about that, but Frig, so few laptops these days let you upgrade the RAM, and I absolutely love that that's an option. Also the SSDs, you can just come in here, give that a little turn, and bam! Once again, totally toolless, and you can put an SSD there, and another one over here if you want to upgrade it down the room. In here we also have three fans, which is very nice, so we have these two right here, which are primarily for your GPU and CPU, although also this third one down here is blowing across like your VRMs and stuff like that to make sure that things other than your main components stay cool. Speaking of other things, they actually have the intakes for this on the keyboard, so you're sort of actively cooling down the keyboard with the air that's going into it, so you don't have to worry about your fingers getting all Bernie burned from the laptop. In here",
    "intakes for this on the keyboard, so you're sort of actively cooling down the keyboard with the air that's going into it, so you don't have to worry about your fingers getting all Bernie burned from the laptop. In here we also have a vapor chamber that goes all the way across the back, and on the CPU and GPU we have liquid metal to make sure they stay nice and cool. Now one thing that ASUS couldn't really do is make the battery life incredible. In here we have a 91 hour battery, which is getting pretty close to as big as they could get into it, but not big enough to deliver a lot of battery life. We got five hours and 44 minutes, which is impressive given the power, not impressive if you compare it to anything that's not powerful. Oh, that is so sick. And the laptop overall is pretty sick. I do have to say that I quite like it. It is heaps powerful, the display is awesome and the price is high. This thing right here is $3,300 as spec'd, and if you want a 59-e, which, that said though, they have an ultra-9",
    "that I quite like it. It is heaps powerful, the display is awesome and the price is high. This thing right here is $3,300 as spec'd, and if you want a 59-e, which, that said though, they have an ultra-9 in here, a 5080, and a bunch of storage and RAM, so you can't really blame them for the price getting at high, and of course you can get like a G14 or something with way less power if you don't want to be spending that much. So huge thanks to Asus for sponsoring this video, huge thanks to you for watching it, and I hope you guys have a great all day. Hit like, get subscribed, and so long."
  ]
}