{
  "chunks": [
    "So this is the brand new 2025 Lenovo lock and over the past couple of years, lock has quietly been one of the best affordable gaming laptops you can buy sometimes it's Ace or sometimes it's Lenovo but this one it's a little different and I'm going to tell you why. But first we have to start with the design and instead of going full gamer spaceship Lenovo kept it simple with this one. It looks a lot like the tone down Legion, clean line, subtle accents, nothing that screams car GB dragon which is kind of smart because a lot of you are going to be lugging this to class or work and you don't want to laptop that looks like it wants to destroy your teacher or maybe you do but I'm not here to judge okay. The chassis is plastic so no surprise at this price point but it's put together well and feels solid in the hand. The top lid does have a bit of flex if you push on it but I've seen way flimsier. The mirrored LOQ lettering is minimal and there's a tiny Lenovo badge on the left side. Now overall budget Legion",
    "hand. The top lid does have a bit of flex if you push on it but I've seen way flimsier. The mirrored LOQ lettering is minimal and there's a tiny Lenovo badge on the left side. Now overall budget Legion vibes but in a good way. Weight is about 5.29 pounds without the power brick so it's not ultra light but easy enough to kind of carry around on your backpack for long periods of time. Now I also happen to like the port layout kind of because on the right you do get a USB-C port this is not USB-4 you have your camera switch which disables or enables it. Combo audio jack and then a USB-A port. Along the back you've got even more. You have another USB-A port HDMI RJ45 Ethernet. You have your slim power connector port and then you have another USB-A port. Now the good news is the power brick which is 245 watts is surprisingly thin for the wattage that you get but look the left side there's nothing there there's no ports at all and like I said USB-C does not support USB-4 like you're literally capped at 10 gigabits a second",
    "is surprisingly thin for the wattage that you get but look the left side there's nothing there there's no ports at all and like I said USB-C does not support USB-4 like you're literally capped at 10 gigabits a second so super handy with the port lineup just not super high bandwidth but there is a nice touch to the port setup. On the back you get port labels which are printed at the rear IO so when you're reaching around your desk you can actually see where you're plugging in without doing any yoga. Now I understand it's a small thing but it's also a quality of life thing. Opening it up with one finger is super easy and the hinge lets the screen go almost flat. Great if you want to like tuck it under your desktop monitor and use the built-in keyboard and trackpad with your desktop setup. Speaking of the keyboard genuinely pleasant like it's not going to beat a Legion 7 bro nor do I expect it but the keys are clicky. Travel is good and you get a full numpad if you live in spreadsheets. The unit has white backlighting but there is an",
    "going to beat a Legion 7 bro nor do I expect it but the keys are clicky. Travel is good and you get a full numpad if you live in spreadsheets. The unit has white backlighting but there is an RGB version if that's your thing. Sticker placement though it's not a crime scene but the G-Force and AMD badges could use couple therapy. Now the display on this model is 15.6 inches 19.20x1080 aspect ratio. Classic 16x9 yes the big black bezels are there and color accuracy just happens to be solid which is great. The gamut is better than you'd expect at this price point and the brightness and SDR is above average. It also supports g-sync which is great for tearing free gaming. With an RTX 5060 topping out in this chassis 1080p is honestly the sweet spot. If you want QHD Lenovo does sell a different panel option just make sure to pick the right skew. Now unfortunately biometrics there's none like there's no fingerprint scanner there's no IR for Windows hello using facial recognition you're logging in with a pin or password like it's 2018. It's not a deal breaker at this price but it's",
    "Now unfortunately biometrics there's none like there's no fingerprint scanner there's no IR for Windows hello using facial recognition you're logging in with a pin or password like it's 2018. It's not a deal breaker at this price but it's worth knowing. So this is what the 1080p webcam looks like on the Lenovo lock actually surprisingly not bad at all for a more affordable gaming laptop. The noise in the background is the microwave so either you can't hear it because of noise cancellation or you're humming you guys let me know but yeah let me know how it looks and how do the microphone sound. But I do have some quick durability notes there's a little bit of screen flex like when you're kind of wobbling it around like this and I would love if the hinges were a tad stiff like the screen is not super wobbly but it could definitely use a little bit of tuning. But we have to talk about performance because the Ryzen 7250 is a leaner chip. Day to day it feels similar to modern low power CPUs like Intel's lunar lake chips snappy on the desktop quick to awake fine for",
    "But we have to talk about performance because the Ryzen 7250 is a leaner chip. Day to day it feels similar to modern low power CPUs like Intel's lunar lake chips snappy on the desktop quick to awake fine for productivity but for heavier tasks like compiling mudzilla firefox it took about 41 minutes okay single core scores hover around the good enough mark while the latest high boost chips are 20% plus higher. Multicore is also lower because this is an efficiency first part. If you do heavy creative work there are better options out there. The display is fine for editing but in Premiere Pro with layer timelines the CPU starts to become the bottleneck. Web browsing not the fastest rocket in the sky but you won't notice unless you're benchmarking every tab. Average boost clocks are decent and the CPU package power tops out around 45 watts under sustained load in this chassis. But the GPU is where things earn its keep. The G4's RTX 5060 running at 100 watts with a muck switch yes it does require a reboot. It has aching a bite of V-RAM and in most games it's a little bit faster than",
    "where things earn its keep. The G4's RTX 5060 running at 100 watts with a muck switch yes it does require a reboot. It has aching a bite of V-RAM and in most games it's a little bit faster than a well-tuned RTX 4060 from last year so not the biggest upgrade. In 3DMark Steel Nomad we saw a comfortable lead ahead of an RTX 5050 laptop and a step below a 5070 which is what you'd expect. 1080p gaming is lovely most titles run high ultra at smooth frame rates and for the heaviest games you tweak a couple of sliders and you're good. The 5060 can keep up at this resolution that's the point of the build. I honestly don't think you need the QHD version of this laptop unless you're playing a lot of older titles. Now here's the cool part literally fan noise on this system is shockingly civilized. Under full load it's stayed under 50 decibels in my testing. Most gaming laptops push well past that and flirt with the 60s. On the flip side quiet mode doesn't get whisper quiet. It sits around 42 to 43 which is a bit louder than I'd like",
    "decibels in my testing. Most gaming laptops push well past that and flirt with the 60s. On the flip side quiet mode doesn't get whisper quiet. It sits around 42 to 43 which is a bit louder than I'd like at idle. Still for gaming loads this is one of the quieter machines I've tested. Thermals are insanely good on this laptop. Under sustained load the chassis stayed around 56 degrees Celsius. Sorry not the chassis the CPU at least at its hottest point. That's ridiculously cool for gaming laptop and a huge wind for comfort. The efficiency oriented CPU is doing a lot of heavy lifting here. It just doesn't dump heat into the system the way a big watt HX chip would. The end result fans don't have to scream and your WASD hand doesn't slow cook. Getting inside really easy just a bunch of Philip head screws and once you're in this is what it kind of looks like. You have a nice big cooling system lots of copper big fans to help keep the CPU and GPU at bay. Storage wise you have two storage slots. One is not populated you can put a second drive",
    "looks like. You have a nice big cooling system lots of copper big fans to help keep the CPU and GPU at bay. Storage wise you have two storage slots. One is not populated you can put a second drive here this is a 2240 drive you actually get pretty good reading right speeds but it does support a 2280. Also Wi-Fi card is only Wi-Fi 6E but it is upgradable replaceable if you want to. The other thing that's upgradable is the RAM so there's one stick in here it is a tool channel stick 16 gigabytes you can put a total of 32 gigabytes inside of this laptop. The two speakers are at the bottom and they sound awful like I'm not even going to insult my microphone by playing you a sample. Battery though is what really impressed me and even though this is a 60 watt hour battery really small because it's using that Ryzen 7250 chip the efficiency is there like well over six hours before needing to charge. So here's the bottom line I like this laptop a lot like it's a good laptop and you know it has all the stuff you'd want",
    "chip the efficiency is there like well over six hours before needing to charge. So here's the bottom line I like this laptop a lot like it's a good laptop and you know it has all the stuff you'd want an affordable gaming laptop to get you gaming immediately. The only thing that's pulling me back from recommending this to you is the price point. 1299 is ridiculous for this because for that price point there are way better laptops available like I mentioned earlier lots of models from last year but even looking at stuff from this year like you can pick up a gigabyte Aero X 16 with an RTX 5060 with double the storage a QHD display and double the RAM for $150 cheaper or if you pay $100 more you can buy an ASUS Zephyr's G14 with the 5060 a better CPU and double the storage. So unless this thing significantly drops its price to let's say I don't know around a thousand to a thousand and fifty it's hard to recommend for its current price point because there's just much better laptops for better deals. If you have any questions let me know in the",
    "say I don't know around a thousand to a thousand and fifty it's hard to recommend for its current price point because there's just much better laptops for better deals. If you have any questions let me know in the comments section down below I'll place a link to this and my suggestions below in case you're interested in checking them out hit the like button if you liked the video subscribe if you haven't already and I'll see you guys in the next one."
  ]
}