{
  "chunks": [
    "The Lenovo lock is the kind of laptop you get when you don't want to vaporize your wall into a blivian but at the same time you want a decent gaming performance on a laptop. Of course, competition here is pretty feared with the likes of HB's Victus series and of course Aces's tough series. So let's see exactly what the lock is capable of. It has been refreshed with the latest internals including AMD's Ryzen 7250 processor, 16GB of DDR5 memory, and Vitya's RTX 5060 GPU with 8GB of video memory. We also do have a 512GB SSD, slightly dated WiFi 6 and Bluetooth version 5.3 standards and we do have a full HD 15-inch display here. Now look, like I said, the lock is in a pretty fierce area in terms of competition between the value-slash midrange gaming laptop category. We're going to see if it can dish it out and whether or not this is the right value proposition for you. So let's get into it. In terms of the unpackaging experience, look, it's really straightforward. It's basically a cardboard box. Inside that box behind some more protective packaging, we have one of the most beautiful looking",
    "value proposition for you. So let's get into it. In terms of the unpackaging experience, look, it's really straightforward. It's basically a cardboard box. Inside that box behind some more protective packaging, we have one of the most beautiful looking gaming laptops have seen in a while. The lock itself is more than that in just a bit. We also do have a 170W charging brick which is actually kind of smaller compared to the competition. I'm happy about that and then of course a wall out there charging cable piece which provides good extendability. As I was saying about the design of the Lenovo lock, look, this is a fantastic looking laptop but it's equally well built as far as value-oriented laptops go. I mean, Lenovo has included a metallic surface for the top lid over here which is pretty standard in this class category but the rest of the body might be made of plastic but it's not the cheap kind of plastic. I mean it's sturdy, dense, plastic and it feels like it's top tier material. With that said, I love the diagonal cut corners with the dual edge design so much personality with this laptop going",
    "the cheap kind of plastic. I mean it's sturdy, dense, plastic and it feels like it's top tier material. With that said, I love the diagonal cut corners with the dual edge design so much personality with this laptop going overboard and that's something Lenovo is really good at doing. Now with that said, of course the laptop does have a weight of 5.08 pounds which is actually heavier in your typical 15-inch gaming laptop and again that's primer to do the density of the material here which provides a high quality device. Now of course, the other is a little bit of fingerprint magnum to them on the top but nothing too dramatic. The majority of the IOPorts appear to be on the rear side of this laptop alongside the heat exhaust fan so in the center you do have two USB-A Super Speed ports, you have one Ethernet port, you have the charging DC port and then you have a HDMI 2.1 port. Now on the right side, you have one more USB-A Super Speed port, you do have a basic Type-C port with no USB 4 standards unfortunately, you do have the good old headphone jack and",
    "have a HDMI 2.1 port. Now on the right side, you have one more USB-A Super Speed port, you do have a basic Type-C port with no USB 4 standards unfortunately, you do have the good old headphone jack and then you have the eShutter button. The only thing that's really missing here is the inclusion of a ST card reader and perhaps one more Type-C port so things aren't great but they aren't bad either. I genuinely appreciate the bottoms of this laptop, it is technically a removable lid but what's nice over here is that Lenovo has only included air intake vents where the actual fans are so you don't have a build-up of dust for no good reason and also of course you will notice you have two speaker grills so this is a bottom-firing setup, I will talk about the speaker system a little bit later on in the video. Unfolding this laptop actually has a reasonably large palm rest as large as a 15-inch form factor can be anyways. With that said, at the center you do have a somewhat small crack pad and I guess that's where the extra space comes from for the",
    "reasonably large palm rest as large as a 15-inch form factor can be anyways. With that said, at the center you do have a somewhat small crack pad and I guess that's where the extra space comes from for the palm rest. Look, I don't have a problem with the small crack pad itself, what I don't appreciate is the thin layer of plastic here as well as the high degree of flex with every click. It's unbecoming a Lenovo to include cheap crack pads, they don't normally do this but yet here we are with this one. But hey, cheer up because we do get a fantastic keyboard. In fact, they've pretty much slapped on the same keyboard here that they do with their idea, pat and yoga series it seems. They've got nice large keycaps, easy to read font. Unfortunately, you don't get RGB backlighting but the backlighting is quite bright. You have a nice full-size 10-key pad for productivity reasons as well and as far as you type in experiences concern you have a ton of key travel. There's a good amount of tactility, this is a great keyboard for gaming and productivity alike. You've got a",
    "for productivity reasons as well and as far as you type in experiences concern you have a ton of key travel. There's a good amount of tactility, this is a great keyboard for gaming and productivity alike. You've got a decent hinge mechanism with a near 180 degree tilt, it's definitely better than the likes of the HP Victus, so there is that. And then of course, as far as display fitting goes, you've got a plastic encasing around, again pretty standard stuff, a bit of a noticeable chin at the bottom but nothing too dramatic and you'll notice you have relatively narrow bezels on the side for a good immersive view and then on the top a relatively thin forehead at the center of which you actually have a 5 megapixel or quad HD webcam which is actually quite clear and uncommonly good for this class category. This is normally the tragic part where I tell you that laptops have cheap down on display but that's for the most part not the case here. So with Lenovo Lock 15, features a full HD IPS panel with a 16 by 9 aspect ratio. Of course, we do get a nice",
    "have cheap down on display but that's for the most part not the case here. So with Lenovo Lock 15, features a full HD IPS panel with a 16 by 9 aspect ratio. Of course, we do get a nice fluid 144Hz refresh rate which is great for competitive gaming. Furthermore, we do have a peak brightness of 300 nits, slightly underwhelming but thanks to a effective anti-thera-coding, it's manageable. Now as far as the color accuracy is concerned, we actually get a 100% SRGB rating which means not only is laptops efficient for gaming, it's also pretty decent for photo or video editing purposes for example. In terms of technical specifications, a quick recap so we do have AMDs Ryzen 7 processor though you can downgrade to a Ryzen 5 instead. We get 16 gigabytes of DDR5 memory however you can scale that up to 32 gigabytes. Furthermore, we do have Nvidia's RTX 5060 GP with 8 gigabytes of video memory and a combined total output of 115 watts. Now it is worth noting you can downscale to a slightly less powerful RTX 5050. In terms of general performance, Lenovo Lock is a very capable device. Everything from surfing",
    "video memory and a combined total output of 115 watts. Now it is worth noting you can downscale to a slightly less powerful RTX 5050. In terms of general performance, Lenovo Lock is a very capable device. Everything from surfing the web to watching videos online is obviously going to be a smooth experience. More power productivity activities like coding and programming, quote compilation. Again, not an issue for this machine. You have plenty of RAM, you have plenty of power. It's a smooth experience. You can even do 3D modeling on programs like Blender at a ton of elements and you're going to have a great experience while I would highly recommend getting 30 gigabytes of memory so you don't have any rendering issues or you don't find performance when you really get complicated in terms of the elements and visuals. Now as far as 4K video editing goes, this laptop is a champion. It's able to stack up multiple layers of 4K footage with little to no frame drops. In fact, it's not until you do color grading, do you notice any sort of limitation and again, having 32 gigabytes of memory here can significantly reduce even that",
    "multiple layers of 4K footage with little to no frame drops. In fact, it's not until you do color grading, do you notice any sort of limitation and again, having 32 gigabytes of memory here can significantly reduce even that issue on its own merit and provide slightly faster render times. Now I'm going to assume you bought this laptop for gaming purposes if not, well that's a bigger problem. But anyways, gaming performance is pretty good at the full HD level with the RTX 5060 GPU. For example, games like Cyberpunk 2077, at the native resolution with DLSS and Frametime enabled, running between a mix of high and ultra settings are able to yell around 68 frames per second, which is a pretty decent number. Now less demanding games like Constri go to are able to sustain 111 frames per second on average with DLSS enabled, again a very competitive number. Games like Expedition 33, which have had less time to mature, are still yielding around 98 frames per second at high settings on the native resolution. Of course that number does dramatically drop if you try to max out the game at full HD. Games like Doom Eternal,",
    "time to mature, are still yielding around 98 frames per second at high settings on the native resolution. Of course that number does dramatically drop if you try to max out the game at full HD. Games like Doom Eternal, which are ultra optimized can run and yield or numbers around 139 frames per second with DLSS enabled with a mix of ultra-nightmare and nightmare settings, which is like second highs and high settings basically. Again, fantastic performance overall. We did test a number of other games. I've laid them out here for reference so you can check it out. Equally impressive is the Nova's hyper chamber cooling system. The thermals are great here so we found with the unrealistic peak load this laptop can hit an average surface temperature in the upper one third area of 40 degrees Celsius, which is slightly cooler than most of the competition. A more realistic sustain load will yield around 38 degrees Celsius again a fantastic number overall. Fat noise is just as impressive. In fact, under peak loads we're hitting around 52 to 53 decibels with some minor variation. Again, this is a great number and on the lower side for a",
    "again a fantastic number overall. Fat noise is just as impressive. In fact, under peak loads we're hitting around 52 to 53 decibels with some minor variation. Again, this is a great number and on the lower side for a typical gaming laptop. In terms of self-obgurability, have added. After all, both the DDR5 Sodium slots are entirely upgradable and replaceable. You also do have two M.2 slots, both of which support 2280 drives, one of which of course is pre-occupied. And then you do have the Wi-Fi card, which is also M.2 base, so you can upgrade to a more powerful Wi-Fi module. Equipped with a 61 hour battery, look, the fact is that's like having a 30-liter tank on a V8 engine. It's not going to last very long with the specs we have here, so you can realistically expect about four hours of runtime with a general productivity use case and obviously way less if you are gaming on battery. But to be fair, gaming laptops aren't known to have great battery life, so we can kind of live this one slide. Now on a much gloomier note, the speaker system here is probably procured straight out",
    "gaming on battery. But to be fair, gaming laptops aren't known to have great battery life, so we can kind of live this one slide. Now on a much gloomier note, the speaker system here is probably procured straight out of a Leibov's clearance section. Like I mean, Nova put zero effort. It is one of the shallowest sounding sound systems I've seen in a while. Here's a quick sound test for reference. With a 1300 US dollar price tag for the configuration reviewed today, the fact that it's laptop is slightly more expensive than some of the competition like the HP Victus, but not by a lot, we're talking like 50 bucks, give or take. With that said, though, it is the finest built machine of that entire class segment. The way Lenovo's just composed this device, its design language, the material density, makes this a laptop so good that it often outweighs even premium terry gaming laptops in terms of sheer build quality. It also offers a decent selection of reports, a modest display with good enough specs for a good full HD gaming experience and great performance combined with fantastic thermals, all which of course are necessary",
    "terms of sheer build quality. It also offers a decent selection of reports, a modest display with good enough specs for a good full HD gaming experience and great performance combined with fantastic thermals, all which of course are necessary for a great gaming experience. In general, if that's your sheer objective, a good gaming experience at the full HD level without breaking the bank, this laptop definitely delivers. It's not perfect. The trackpad definitely has room for improvement or the ports should have had slightly better standards with the Type-C ports, having an SD card reader for example, or improving the hideous sound system should be a priority for future generations, but beyond those things, I still think this is one of the best gaming laptops in the value level segment. Let me know what you think of the Lenovo Lock 15. If you already have it, I'd love to hear your thoughts and as always, if you guys enjoyed the content, make sure you hit that like button and sub to our channel. It genuinely helps us grow and mean so real to me. Catch you in the next one.",
    "enjoyed the content, make sure you hit that like button and sub to our channel. It genuinely helps us grow and mean so real to me. Catch you in the next one."
  ]
}